accents = """агронОмія
алфАвІт
Аркушик
асиметрІя
багаторазОвий
безпринцИпний
бЕшкет
блАговіст
близькИй
болотИстий
борОдавка
босОніж
боЯзнь
бурштинОвий
бюлетЕнь
вАги (у множині)
вантажІвка
веснЯнИй
вИгода (користь)
вигОда (зручність)
видАння
визвОльний
вимОга
вИпадок
вирАзний
вИсіти
вИтрата
вишИваний
відвезтИ
відвестИ
вІдгомін
віднестИ
вІдомість (список)
відОмість (повідомлення, дані, популярність)
вІрші
віршовИй
вітчИм
гальмО
гАльма
глядАч
горошИна
граблІ
гуртОжиток
данИна
дАно
децимЕтр
дЕщиця
де-Юре
джерелО
дИвлячись
дичАвіти
діалОг
добовИй
добУток
довезтИ
довестИ
довІдник
дОгмат
донестИ
дОнька
дочкА
дрОва
експЕрт
єретИк
жалюзІ
завдАння
завезтИ
завестИ
зАвжди
завчасУ
зАгадка
заіржАвілий
заіржАвіти
закінчИти
зАкладка (у книзі)
зАкрутка
залишИти
замІжня
занестИ
зАпонка
заробІток
зАставка
зАстібка
застОпорити
звИсока
здАлека
зібрАння
зобразИти
зОзла
зрАння
зрУчний
зубОжіння
індУстрія
кАмбала
каталОг
квартАл
кИшка
кіломЕтр
кінчИти
кОлесо
кОлія
кОпчений (дієприкметник)
копчЕний (прикметник)
корИсний
кОсий
котрИй
крицЕвий
крОїти
кропивА
кулінАрія
кУрятина
лАте
листопАд
літОпис
лЮстро
мАбУть
магістЕрський
мАркетинг
мерЕжа
металУргія
мілімЕтр
навчАння
нанестИ
напІй
нАскрізний
нАчинка
ненАвидіти
ненАвисний
ненАвисть
нестИ
нІздря
новИй
обіцЯнка
обрАння
обрУч (іменник)
одинАдцять
одноразОвий
ознАка
Олень
оптОвий
осетЕр
отАман
Оцет
павИч
партЕр
пЕкарський
перевезтИ
перевестИ
перЕкис
перелЯк
перенестИ
перЕпад
перЕпис
піалА
пІдданий (дієприкметник)
піддАний (іменник, істота)
пІдлітковий
пізнАння
пітнИй
піцЕрія
пОдруга
пОзначка
пОмилка
помІщик
помОвчати
понЯття
порядкОвий
посерЕдині
привезтИ
привестИ
прИморозок
принестИ
прИчіп
прОділ
промІжок
псевдонІм
рАзом
рЕмінь (пояс)
рЕшето
рИнковий
рівнИна
роздрібнИй
рОзпірка
рукОпис
руслО
сантимЕтр
свЕрдло
серЕдина
сЕча
симетрІя
сільськогосподАрський
сімдесЯт
слИна
соломИнка
стАтуя
стовідсОтковий
стрибАти
текстовИй
течіЯ
тИгровий
тисОвий
тім’янИй
травестІя
тризУб
тУлуб
украЇнський
уподОбання
урочИстий
усерЕдині
фартУх
фаховИй
фенОмен
фОльга
фОрзац
хАос (у міфології: стихія)
хаОс (безлад)
цАрина
цемЕнт
цЕнтнер
ціннИк
чарівнИй
черговИй
читАння
чорнОзем
чорнОслив
чотирнАдцять
шляхопровІд
шовкОвий
шофЕр
щЕлепа
щИпці
щодобовИй"""


""" 
    HEADER = '\033[95m'
    OKBLUE = '\033[94m'
    OKCYAN = '\033[96m'
    OKGREEN = '\033[92m'
    WARNING = '\033[93m'
    FAIL = '\033[91m'
    ENDC = '\033[0m'
    BOLD = '\033[1m'
    UNDERLINE = '\033[4m'
"""

def findDifference(str1, str2):
    """str1 - correct, str2 - incorrect """
    output = '\033[1m'
    for i in range(max(len(str1), len(str2))):
        try: str1[i]
        except: continue
        try: str2[i]
        except: 
            output += '\033[93m' + str1[i]
            continue
        if str1[i] == str2[i]: output += '\033[92m' + str1[i];
        else: output += '\033[91m'+  str1[i]
    return output    
    
    
print('\033[1m' + '\033[94m' + '~ ~ Невеличкий скрипт для перевірки наголосів для НМТ :). \n > мій гітхаб: https://github.com/Ak1yamaKiyoshi')
print('\033[1m' + '\033[91m' + " > введіть 'ЗУПИНИТИСЬ' щоб зупинитись і побачити результати " + '\033[0m')
print('\033[1m' + '\033[4m' + '\033[95m' " > Вам потрібно вводити слова позначаючи наголос великою літерою: алфАвІт")
print('\033[0m' + '\033[93m' + '\033[1m' + ' > Поточне слово -> слово без позначеного наголосу \n      [000/231]  ->  алфавіт ')
print('\033[0m' + '\033[1m' + '\033[4m' + ' > Успіхів! '+ '\033[0m')

answers = {"correct":0,"incorrect":0,"skipped":0, "saved_incorrect":[]}
for index, i in enumerate(set(accents.split("\n"))):
    current_correct_accent = i[:i.find("(")].strip() if "(" in i else i.strip()
    
    print(""
        + '\033[94m' + f"[{index+1:03d}/231]"
        + '\033[0m' + " -> "
        + '\033[1m' + '\033[93m' + '\033[4m' + f"{i.lower()}"
        )
    
    current_user_accent = input('\033[0m' + f"Позначте наголос: " + '\033[1m').strip();
    if current_user_accent == current_correct_accent: answers["correct"] += 1
    elif current_user_accent == "": answers["skipped"] += 1
    elif current_user_accent == "ЗУПИНИТИСЬ": answers['skipped'] += (231 - index); break
    else: 
        answers['incorrect'] += 1
        error = findDifference( current_correct_accent, current_user_accent)
        print('\033[0m' + f" > {error}")
        answers['saved_incorrect'].append(error)
        

print(""
      +        '\033[1m' +'\033[95m' + "__________________"
      + '\n' + '\033[1m' + '\033[92m' + "Правильно   ->  " + f"{answers['correct']}"
      + '\n' + '\033[1m' + '\033[91m' + "Неправильно ->  " + f"{answers['incorrect']}"
      + '\n' + '\033[1m' + '\033[93m' + "Разом       ->  " + f"{answers['correct'] + answers['incorrect']}"
      + '\n' + '\033[1m' + '\033[94m' + "Пропущено   ->  " + f"{answers['skipped']}"
      + '\033[0m'
      )

if input("Вивести помилки? так/ні: ") == "так":
    for index, i in enumerate(sorted(answers['saved_incorrect'])):
        print('\033[0m' + '\033[1m'  + '\033[96m'+ f"[{index+1:03d}/{answers['incorrect']:03d}]: {i}")

input('\033[93m' + " Натисніть Enter щоб закрити консоль ")